<img src='images/header.png' style='height: 50px; float: left'>

## Introduction to Computational Social Science methods with Python

# Session A2: Data management with Pandas

**Data** has two components: content and structure. Plain text data is unstructured, but its content can also be represented in a structured way. Data representations reside in a continuum of structuration. The rectangular table (also called dataframe or spreadsheet) is the most frequent data format in the social sciences because it is perfectly suited to manage the highly structured (survey) data that social scientists have typically worked with. Hierarchical data formats like JSON and HTML are semi-structured, and text data is unstructured (<a href='#weidmann_data_2023'>Weidmann 2023</a>, ch. 3). The practice of Computational Social Science primarly revolves around **Digital Behavioral Data**, the traces of behavior left by uses of or harnessed by digital technology. In a data life cycle, data changes its face from a raw state to a state in which it is ready for analysis. **Data processing** subsumes the steps in which this transformation takes place (<a href='#weidmann_data_2023'>Weidmann 2023</a>, ch. 1).

**Data management** refers to the practices by which we stay in control of data as a resource. Data is best managed with a focus on practical questions. Since data processing is about bringing data into a form that permits answering those questions, it is strategically advantageous also to focus data management on data processing. Computational data processing workflows are beneficial because they fully document the many steps from data collection to data analysis, they are convenient (like your favorite spreadsheet software could never be), they are reproducible (nowadays in high demand), they can be scaled up (necessary for [big data](https://en.wikipedia.org/wiki/Big_data)), and they offer the needed flexibility in the face of semi-structured or unstructured data sources (<a href='#weidmann_data_2023'>Weidmann 2023</a>, p. 7–9).

<img src='images/pandas.png' style='height: 100px; float: right; margin-left: 10px'>

[Pandas](https://pandas.pydata.org/), self-described as a "fast, powerful, flexible and easy to use open source data analysis and manipulation tool", is Python's package for data management and processing using 2-dimensional tables (<a href='#mclevey_doing_2022'>McLevey, 2022</a>, ch. 6). It allows you to work with any kind of observational or statistical data set, including matrices. Column entries can be heterogeneous (*i.e.*, a single column can contain text, numerical values, or even lists). Pandas can be used in a way that mimics the functionality of **relational databases**. These are systems where the columns of a table are split into multiple tables such that redundancies are eliminated. Relational databases are often used in research when the data is either large in volume or rich in content because they ensure consistency and speed up data processing (<a href='#weidmann_data_2023'>Weidmann 2023</a>, part 3).

The public [TweetsKB](https://data.gesis.org/tweetskb/) corpus of annotated tweets (<a href='fafalios_tweetskb_2018'>Fafalios *et al.*, 2018</a>), as well as its offspring, the [TweetsCOV19](https://data.gesis.org/tweetscov19/) corpus (<a href='dimitrov_tweetscov19_2020'>Dimitrov *et al.*, 2020</a>), are examples where the data is explicitly modeled relationally and can serve as illustrations of meaningful data management. Pandas is also well-equipped to handle time series data, as we will see.

<div class='alert alert-block alert-success'>
<b>In this session</b>, 

you will learn how to manage your data and keep it tidy while keeping a focus on your research questions. We will have a deep look at the 2-dimensional table as the fundamental data structure we will work with throughout all sessions. In subsession **A2.1**, we start with some illustrative toy examples about important dataframe properties. In subsession **A2.2**, we enter the almost-big-data world using the TweetsCOV19 dataset. You will experience how you can use Pandas to handle tables and mimic a relational database in such a way that your data gets ready for analysis. You will see what it means that relational databases eliminate redundancy and ensure consistency. The TweetsCOV19 dataset will function as an example that will shine up repeatedly in this and subsequent sessions. In subsession **A2.3**, you will see how you can save processed data to multiple files, an SQL database, or Excel. Subsession **A2.4** is dedicated to how data can be retrieved from the relational data structure we have created.
</div>

<div class='alert alert-block alert-danger'>
<b>Caution</b>

This Jupyter Notebook demonstrates a workflow that consists of a **sequence of processing steps**. In this process, tables are created, changed, and deleted. Hence, the notebook must be executed from top to bottom. Going back up from a certain code cell and trying to execute a cell that precedes it may not work.
</div>

## A2.1. Toy examples

#### Data and structure

In subsections 3.2 to 3.4, <a href='#weidmann_data_2023'>Weidmann 2023</a> discusses data, data processing, and the benefit of relational databases using toy examples and the R language. Here, we adapt these examples to Python. Keep in mind that data = content + structure. Furthermore,  consider the following two pieces of data. They have (almost) the same content but a different structure. `sdb` represents unstructured data, `tdb` is structured:

In [1]:
sdb = 'Switzerland is a country with 8.3 million inhabitants, and its capital is Bern. Another country is Austria; its capital is Vienna and the population is 8.7 million.'
sdb

'Switzerland is a country with 8.3 million inhabitants, and its capital is Bern. Another country is Austria; its capital is Vienna and the population is 8.7 million.'

In [2]:
import pandas as pd
pd.__version__

'1.4.4'

In [3]:
tdb = pd.DataFrame(data=[['Switzerland', 8.3, 'Bern'], ['Austria', 8.7, 'Vienna']], columns=['country', 'population', 'capital'])
tdb

       country  population capital
0  Switzerland         8.3    Bern
1      Austria         8.7  Vienna

`tdb` is a Pandas table called a [DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html). The columns of a DataFrame are called [Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html). A DataFrame contains labeled axes (rows and columns). Axis 0 (the rows) is called the **index**, and its labels consist of integers from $0$ to $n-1$ by default, where $n$ is the number of rows:

In [4]:
tdb.index

RangeIndex(start=0, stop=2, step=1)

When no names are given, the **columns** (axis 1) are also labeled in such a way, but using text labels makes the table much more readable:

In [5]:
tdb.columns

Index(['country', 'population', 'capital'], dtype='object')

Similarly the index can be a list of text labels or unordered integers.

Rows, columns, or cells can be extracted by specifying their [`loc`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html)ations (labels). For example, to extract the capital of the second row (Austria):

In [6]:
tdb.loc[1, 'capital']

'Vienna'

Filtering data. For example, selecting all rows where the country is Switzerland:

In [7]:
tdb[tdb['country'] == 'Switzerland']

       country  population capital
0  Switzerland         8.3    Bern

To add a new column:

In [8]:
tdb['area'] = [41, 83]
tdb

       country  population capital  area
0  Switzerland         8.3    Bern    41
1      Austria         8.7  Vienna    83

The values in the 'area' column are of the integer data type:

In [9]:
tdb['area'].dtype

dtype('int64')

To add a new row, we must first create a DataFrame containing the new row. Then we can [`concat`](https://pandas.pydata.org/docs/reference/api/pandas.concat.html)enate the two dataframes on the index axis:

In [10]:
new_row = ['Liechtenstein', 0.038 , 'Vaduz', 0.16]
tdb_new_row = pd.DataFrame(data=[new_row], columns=tdb.columns)
tdb = pd.concat(objs=[tdb, tdb_new_row], axis=0)
tdb

         country  population capital   area
0    Switzerland       8.300    Bern  41.00
1        Austria       8.700  Vienna  83.00
0  Liechtenstein       0.038   Vaduz   0.16

Note that the 'area' column is now a continuous numerical variable:

In [11]:
tdb['area'].dtype

dtype('float64')

But also note that concatenation results in the old indexes being used (the third row also has index 0). To reset the index and drop the old values:

In [12]:
tdb = tdb.reset_index(drop=True)
tdb

         country  population capital   area
0    Switzerland       8.300    Bern  41.00
1        Austria       8.700  Vienna  83.00
2  Liechtenstein       0.038   Vaduz   0.16

To remove the column 'area'  we can [`drop`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html) it (use `axis=1`) and put the result `inplace` of the original table:

In [13]:
tdb.drop(labels=['area'], axis=1, inplace=True)
tdb

         country  population capital
0    Switzerland       8.300    Bern
1        Austria       8.700  Vienna
2  Liechtenstein       0.038   Vaduz

Alternatively, you could have used `del` which also works for whole dataframes:

In [14]:
# del tdb['area']

Rows can only be removed with the `drop()` method by using `axis=0`:

In [15]:
tdb.drop(labels=[2], axis=0, inplace=True)
tdb

       country  population capital
0  Switzerland         8.3    Bern
1      Austria         8.7  Vienna

#### Wide vs. long structure

A rule in data management states that tables should grow long, not wide. Consider this `bad_table` of two countries' population sizes in three years:

In [16]:
bad_table = pd.DataFrame(data=[['Switzerland', 4.7, 5.3, 6.2], ['Austria', 6.9, 7.1, 7.5]], columns=['country', 'pop1950', 'pop1960', 'pop1970'])
bad_table

       country  pop1950  pop1960  pop1970
0  Switzerland      4.7      5.3      6.2
1      Austria      6.9      7.1      7.5

Though appealing to the eye, this table is computationally bad, as can be demonstrated by trying to compute the average population size over all countries and years. It is relatively easy to compute the mean for each year by selecting the corresponding columns.

In [17]:
bad_table[['pop1950', 'pop1960', 'pop1970']].mean(axis=0)

pop1950    5.80
pop1960    6.20
pop1970    6.85
dtype: float64

But computing the overall mean requires selecting columns and taking the mean of the year means:

In [18]:
bad_table[['pop1950', 'pop1960', 'pop1970']].mean().mean()

6.283333333333334

A `good_table` is long, not wide:

In [19]:
good_table = pd.DataFrame(data=[['Switzerland', 1950, 4.7], ['Switzerland', 1960, 5.3], ['Switzerland', 1970, 6.2], ['Austria', 1950, 6.9], ['Austria', 1960, 7.1], ['Austria', 1970, 7.5]], columns=['country', 'year', 'population'])
good_table

       country  year  population
0  Switzerland  1950         4.7
1  Switzerland  1960         5.3
2  Switzerland  1970         6.2
3      Austria  1950         6.9
4      Austria  1960         7.1
5      Austria  1970         7.5

Computing the overall mean is a simple operation on one column...

In [20]:
good_table['population'].mean()

6.283333333333334

and the year means can be obtained via aggregation (using the [`groupby()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html) method) without having to specify any year columns:

In [21]:
good_table

       country  year  population
0  Switzerland  1950         4.7
1  Switzerland  1960         5.3
2  Switzerland  1970         6.2
3      Austria  1950         6.9
4      Austria  1960         7.1
5      Austria  1970         7.5

In [22]:
good_table[['year', 'population']].groupby('year').mean().reset_index()

   year  population
0  1950        5.80
1  1960        6.20
2  1970        6.85

#### Multiple tables

What does it mean that relational databases eliminate redundancies and ensure consistency? Consider a copy of the `good_table` with an additional column that contains a country's capital (copying makes sure that any changes made to `good_table2` do not affect the original `good_table`):

In [23]:
good_table2 = good_table.copy()
good_table2.loc[0:2, 'capital'] = 'Bern'
good_table2.loc[3:5, 'capital'] = 'Vienna'
good_table2

       country  year  population capital
0  Switzerland  1950         4.7    Bern
1  Switzerland  1960         5.3    Bern
2  Switzerland  1970         6.2    Bern
3      Austria  1950         6.9  Vienna
4      Austria  1960         7.1  Vienna
5      Austria  1970         7.5  Vienna

Clearly, this table contains redundant information because country-capital pairs are always the same. This data format also potentially yields a consistency problem. If, for example, one wants to refer to capital names not in English but in the respective national language, one must replace each occurrence of 'Vienna' (English) with 'Wien' (German). But if you miss a single occurrence, your table becomes inconsistent. You can evade both problems if you split `good_table2` into two tables: one containing the population sizes...

In [24]:
populations = good_table2[['country', 'year', 'population']].copy()
populations

       country  year  population
0  Switzerland  1950         4.7
1  Switzerland  1960         5.3
2  Switzerland  1970         6.2
3      Austria  1950         6.9
4      Austria  1960         7.1
5      Austria  1970         7.5

and one containing the capitals:

In [25]:
capitals = good_table2[['country', 'capital']].drop_duplicates().reset_index(drop=True)
capitals

       country capital
0  Switzerland    Bern
1      Austria  Vienna

This way, you have eliminated all redundancies and ensured consistency because you need to replace 'Vienna' with 'Wien' in one place only.

Next, we will take Pandas and relational database thinking to the next level.

## A2.2. The TweetsCOV19 dataset

[Twitter](https://en.wikipedia.org/wiki/Twitter) is a microblogging service that is very influential among politicians and journalists. Though stagnating over the past years, the number of monthly active users was 238 million in the second quarter of 2022 (<a href='#wikipedia_twitter_2022'>Wikipedia, 2022</a>). Since January 2013, researchers at [L3S](https://www.l3s.de/) and [GESIS](https://www.gesis.org/) have been collecting a 1% random sample of all Twitter transactions (tweets), detecting sentiments, and extracting named entities, user mentions, hashtags, as well as URLs, and making those publicly available as the [TweetsKB](https://data.gesis.org/tweetskb/) corpus (<a href='#fafalios_tweetskb_2018'>Fafalios *et al.*, 2018</a>). By August 2022, the corpus had grown to about 3 billion tweets. In the following, we will store the content of a small fraction of those tweets, one month of the [TweertsCOV19](https://data.gesis.org/tweetscov19/) corpus (<a href='#dimitrov_tweetscov19_2020'>Dimitrov *et al.*, 2020</a>), in multiple Pandas dataframes that make reference to the TweetsKB data structure.

### A2.2.1. Ontologies in practice

|<img src='images/model.png' style='float: none; width: 640px'>|
|:--|
|<em style='float: center'>**Figure 1**: Data structure used to build the TweetsKB corpus ([source](https://data.gesis.org/tweetskb/#Data-model))</em>|

The data structure depicted in ***figure 1*** used to build the TweetsKB corpus is relational and uses several standardized ontologies. **Relational** means that each piece of content belongs to a class, and classes have properties that can either describe a class attribute or link to another class. We will shortly see that classes are candidates for tables. Classes and properties are drawn from **ontologies** which are vocabularies for modeling data and, in our particular tweets case, online community data. These vocabularies are developed and maintained by the [Semantic Web](https://en.wikipedia.org/wiki/Semantic_Web) research community, aiming to make internet data machine-readable.

|<img src='images/model_example.png' style='float: none; width: 640px'>|
|:--|
|<em style='float: center'>**Figure 2**: Example of how a tweet is encoded using the data structure</em>|

***Figure 2*** is an example of how a tweet is encoded using this abstract data structure. In other words, the figure depicts how the content of a tweet is modeled as machine-readable data. Starting with the central element, a **tweet** is modeled as belonging to the [Post](https://www.w3.org/Submission/sioc-spec/#term_Post) class, which is defined as an "article or message that can be posted to a Forum" in the [SIOC](http://sioc-project.org/) ontology. A tweet has a [has_creator](https://www.w3.org/Submission/sioc-spec/#term_has_creator) property which relates a tweet to a user. A **user** is modeled as belonging to the [User](https://www.w3.org/Submission/sioc-spec/#term_User) class (in figure 1, the class is called "UserAccount"), which is defined as a "User account in an online community site." The "tweet1" instance of Post as well as the "usr1" instance of User have [id](http://rdfs.org/sioc/spec/#term_id) properties that link to the actual [literal](https://www.w3.org/TR/rdf-schema/#ch_literal) values of the **tweet id** (<span style='font-family:Courier'>9565121266</span>) and (encrypted) **user name** (<span style='font-family:Courier'>2356912</span>) variables. Below, we will create separate Pandas tables for the Post and User classes, among others. Just like in the above example of populations and capitals, this is how redundancy is eliminated.

Starting from such an understanding of separate tables for tweets and users, we can discuss which one some of the other variables belong to which come with the data. The **timestamp**, **number of retweets** (number of users that forward the tweet), and **number of favorites** (number of users that like the tweet) clearly are attributes of tweets. In the example of *figure 1*, "tweet1" is liked by $12$ users, a statistic that is modeled using the [InteractionCounter](https://schema.org/InteractionCounter) for the [LikeAction](https://schema.org/LikeAction) of the [Schema.org](https://schema.org/) vocabulary. The **number of followers** (number of other users that follow a user) and **number of friends** (number of other users a user follows) seem to be attributes of users at first glance. But since they are measured at the time of tweet creation, they are better also attributed to tweets. While the Twitter API delivers these variables, the following variables have been obtained by the corpus creators by processing the tweet content. The sentiment or emotional content of a tweet is modeled by using the [Onyx](https://www.gsi.upm.es/ontologies/onyx/) ontology, which is "designed to annotate and describe the emotions expressed by user-generated content". The [SentiStrength](http://sentistrength.wlv.ac.uk/) algorithm results in **positive sentiment** (1 means low and 5 means high) and **negative sentiment** (-1 means low and -5 means high) variables. Though the sentiment expresses the mind state of a user, it is expressed in language and is, hence, a tweet attribute.

The dataset producers have also annotated tweets by extracting four different kinds of **facts** (communicative symbols) from tweet texts: named entities (universally recognized semantic concepts), user **mentions** (words starting with <span style='font-family:Courier'>@</span>), **hashtags** (words starting with <span style='font-family:Courier'>#</span>), and **URLs** (addresses of web pages). Since URLs are often too detailed, we will also extract the **TLDs** (top-level domains) from URLs. To identify **named entities**, the [FEL](https://github.com/yahoo/FEL) algorithm matches parts of the tweet **text** to Wikipedia pages as universally identifiable resources and provides a **confidence** score to what extent the match is trustworthy (0 means high and -3 means low confidence). In the example of *figure 2*, the text snippet "<span style='font-family:Courier'>Federer</span>" has been matched to the Wikipedia resource [Roger_Federer](https://de.wikipedia.org/wiki/Roger_Federer) with an average confidence of $-1.54$.

|<img src='images/erd.png' style='float: none; width: 640px'>|
|:--|
|<em style='float: center'>**Figure 3**: Entity relationship diagram to organize Pandas tables</em>|

It is clear that named entities, mentions, hashtags, URLs, and TLDs cannot be tweet attributes, as that would create an immense amount of redundancy. Hence, each of these five facts gets its own table. ***Figure 3*** shows the entity relationship diagram into which we will transform the tweets data. The diagram in *figure 3* mirrors the TweetsKB data structure.We will construct the tables shown in the figure by following the rules of [database normalization](https://en.wikipedia.org/wiki/Database_normalization), which we have introduced in section 2.1.1, in the most basic way. Entities are classes in the above sense and are not to be confused with named entities. We will create **entity tables** for the seven entities discussed so far: `tweets`, `users`, `named_entities`, `mentions`, `hashtags`, `utls`, and `tlds`. Each table has a primary key (PK) that uniquely identifies the entity instances in a table. We will use the index of Pandas dataframes as primary keys. Six of those tables have a column called 'tweets', which is the number of tweets a user has created or the number of times a fact has been selected in a tweet.

In addition, we will create five **relationship tables** that put tweets into a relationship to facts (named entities, mentions, hashtags, URLs, and TLDs). Relationship tables are depicted using dashed lines in *figure 3*. They just contain entity identifiers (indices) that are now called foreign keys (FK). We will shortly see that relationship tables can be directly used in data analysis. One of the five tables is an exception: The `tweets_named_entities` table has two more columns – the text that was used to name the named entity and the confidence score – because these are true attributes of the relationship between tweets and named entities. Finally, users and tweets are linked in the tweets table via the 'user_idx' column because a tweet is created by one and only one user.

### A2.2.2. Structuring TweertsCOV19

We will be working with the May 2020 dump of the TweertsCOV19 corpus. Download this [file](https://zenodo.org/record/4593502/files/TweetsCOV19_052020.tsv.gz) and put it into the '../data/TweetsCOV19' folder. The [description](https://data.gesis.org/tweetscov19/#Dataset) of the dataset says that each row contains variables of a tweet instance, there are twelve variables (columns), and variables are separated by a tab character ('\t'). In other words, the data is delivered as a table. Furthermore, the description says that sentiment scores, named entity metadata, etc. are concatenated. In other words, the delivered table is wide in selected columns. Our job will be to transform this table into the multiple tables of *figure 3*. Before reading the full data, it is a good idea to look at the first rows to check if the file contains column names and if there are any peculiarities. Using UTF-8 encoding is recommended since it allows for coding all the different characters used in tweets:

In [26]:
head = pd.read_csv(
    filepath_or_buffer = '../data/TweetsCOV19/TweetsCOV19_052020.tsv.gz', 
    sep = '\t', 
    nrows = 5, 
    encoding = 'utf-8'
)
head

,1255980348229529601,fa5fd446e778da0acba3504aeab23da5,Thu Apr 30 22:00:24 +0000 2020,29697,24040,0,0.1,null;,1 -1,null;.1,Opinion Next2blowafrica thoughts,null;.2
0,1255981220640546816,547501e9cc84b8148ae1b8bde04157a4,Thu Apr 30 22:03:52 +0000 2020,799,1278,4,6,null;,1 -1,null;,null;,null;
1,1255981244560683008,840ac60dab55f6b212dc02dcbe5dfbd6,Thu Apr 30 22:03:58 +0000 2020,586,378,1,2,null;,2 -1,null;,null;,https://www.bbc.com/news/uk-england-beds-bucks...
2,1255981472285986816,37c68a001198b5efd4a21e2b68a0c9bc,Thu Apr 30 22:04:52 +0000 2020,237,168,0,0,null;,1 -1,null;,null;,https://lockdownsceptics.org/2020/04/30/latest...
3,1255981581354905600,8c3620bdfb9d2a1acfdf2412c9b34e06,Thu Apr 30 22:05:18 +0000 2020,423,427,0,0,i hate u:I_Hate_U:-1.8786140035817729;quaranti...,1 -4,null;,null;,null;
4,1255982235662024704,491a98bbc105806cb67f46f5e3f3d888,Thu Apr 30 22:07:54 +0000 2020,52,46,0,0,god forbid:God_Forbid:-1.2640735877261988;covi...,2 -4,Danartman BishopStika,null;,https://www.dailymail.co.uk/health/article-826...

Get the number of rows and columns:

In [27]:
head.shape

(5, 12)

Knowing that the file does not contain column names and that the separator indeed creates twelve columns, we can read the whole file.

<div class='alert alert-block alert-danger'>
<b>Caution</b>

The file we are about to load is almost 200 MB large in compressed format. When loaded into memory as a dataframe, it consumes almost 1 GB. Since we are about to create many new tables from it, which all require significant amounts of memory, you can quickly reach the limits of the machine you are working on. In fact, if we work with the whole file and run the notebook all until the end, it will consume 4.2 GB. This is too much if, for example, you are executing this notebook on mybinder.org, which gives you 2 GB of memory.
</div>

To reduce the memory load, take a sample from the already-sampled file. Setting the `seed()` of the "random" library will create results that are exactly reproducible. `p` is the sample fraction to load. It is set to 25% to use less than 2 GB of memory. Increase it if you have more memory:

In [28]:
import random

In [29]:
random.seed(42)
p = .25

In [30]:
tweets = pd.read_csv(
    filepath_or_buffer = '../data/TweetsCOV19/TweetsCOV19_052020.tsv.gz', 
    sep = '\t', 
    header = None, 
    skiprows = lambda i: i > 0 and random.random() > p, 
    quoting = 3, 
    encoding = 'utf-8'
)

<div class='alert alert-block alert-danger'>
<b>Caution</b>

Setting the `quoting` parameter of the [`read_csv()`](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) function to the value `3` means that no quoting symbols (*e.g.*, quotation marks) are used to enclose the content of cells in columns. This allows that the respective symbol can be a cell content. In the TweetsCOV19 dataset, some hashtags actually contain quotation marks. Not setting the parameter to `3` would result in a wrong reading of the file.
</div>

Since the table does not have column names, we use those from the data [description](https://data.gesis.org/tweetscov19/#Dataset):

In [31]:
tweets.columns = ['tweet_id', 'user', 'timestamp', 'followers', 'friends', 'retweets', 'favorites', 'named_entities', 'sentiments', 'mentions', 'hashtags', 'urls']

In [32]:
tweets

,tweet_id,user,timestamp,followers,friends,retweets,favorites,named_entities,sentiments,mentions,hashtags,urls
0,1255980348229529601,fa5fd446e778da0acba3504aeab23da5,Thu Apr 30 22:00:24 +0000 2020,29697,24040,0,0,null;,1 -1,null;,Opinion Next2blowafrica thoughts,null;
1,1255981244560683008,840ac60dab55f6b212dc02dcbe5dfbd6,Thu Apr 30 22:03:58 +0000 2020,586,378,1,2,null;,2 -1,null;,null;,https://www.bbc.com/news/uk-england-beds-bucks...
2,1255981581354905600,8c3620bdfb9d2a1acfdf2412c9b34e06,Thu Apr 30 22:05:18 +0000 2020,423,427,0,0,i hate u:I_Hate_U:-1.8786140035817729;quaranti...,1 -4,null;,null;,null;
3,1255985637246865410,d6fff22276aad81631affdecb83a8d9a,Thu Apr 30 22:21:25 +0000 2020,101,127,0,0,stealth:Stealth_game:-2.646174787470186;,1 -3,null;,null;,http://www.safetyhealthnews.com/covid-prompted...
4,1255985760790069251,c8f0b58eb5105e2318e15ff17b9e4250,Thu Apr 30 22:21:55 +0000 2020,722,572,4,33,fred guttenberg:Fred_Guttenberg:-1.35898888441...,1 -1,fred_guttenberg GovWhitmer,null;,null;
...,...,...,...,...,...,...,...,...,...,...,...,...
480700,1267178565298241538,29f87bedcbae099aff8588db39666352,Sun May 31 19:38:07 +0000 2020,833,687,0,0,missouri:Missouri:-2.144181677743898;florida:F...,2 -1,null;,null;,null;
480701,1267189109774266369,f67bd1f0c41cb218ad9e143fc8dda6a8,Sun May 31 20:20:01 +0000 2020,2755,3901,0,0,covid 19:Coronavirus_disease_2019:-1.535776454...,2 -2,standardnews,null;,null;
480702,1267189273364578304,a9d5231b8f8ca0bd86884d596bc572dd,Sun May 31 20:20:40 +0000 2020,1610,777,0,0,eat:East_Africa_Time:-2.4654413209752946;,2 -1,jotbro77,null;,null;
480703,1267196986660458499,8e93b969fa0082b6fcba6acc2c9e3e8c,Sun May 31 20:51:19 +0000 2020,52,152,0,0,skynews:Sky_News:-2.4443176685121135;,2 -1,SkyNews,null;,null;
480704,1267207883487354881,0e4323d01d164b9eb6e33f35564c7e25,Sun May 31 21:34:37 +0000 2020,43,931,0,0,china:China:-2.113921624336916;death penalty:C...,1 -2,null;,null;,null;

There are 480 thousand tweets (1.9 million for the full sample). Look at the last five columns to see how multiple annotations are stored in single cells.

#### Creating the `users` table

Besides the 'user' name, the `users` table should also contain the number of tweets the user has created as well as the maximum number of followers and friends. Aggregate the data using `groupby()` with the `size()` method to count the number of rows (i.e., the number of tweets)...

In [33]:
users = tweets.groupby(by='user').size().reset_index(name='tweets')
users.head()

                               user  tweets
0  000016e54a4dc155432ebad949c2546e       1
1  000037774001c1016af0b621b1299657       1
2  000058bdeaa281c0e1648193b163fa4f       1
3  000088cdedbf61ede06e027bdc0710d3       1
4  0000a7994a8534f67944738260474cd7       1

and then with the `.max()` method to get the maximum number of followers and friends:

In [34]:
users_ff = tweets.groupby(by='user')[['followers', 'friends']].max().reset_index()
users_ff.columns = ['user', 'followers_max', 'friends_max']
users_ff.head()

                               user  followers_max  friends_max
0  000016e54a4dc155432ebad949c2546e           6853          992
1  000037774001c1016af0b621b1299657              7           50
2  000058bdeaa281c0e1648193b163fa4f           3823          167
3  000088cdedbf61ede06e027bdc0710d3            999         2570
4  0000a7994a8534f67944738260474cd7            225          851

Since these dataframes are both ordered alphabetically and have the same length, we can simply add the two columns from `users_ff` to the `users` table:

In [35]:
users[['followers_max', 'friends_max']] = users_ff[['followers_max', 'friends_max']]

Sort the dataframe descendingly by the number of tweets, maximum number of followers, and maximum number of friends (in that order):

In [36]:
users = users.sort_values(by=['tweets', 'followers_max', 'friends_max'], ascending=False).reset_index(drop=True)

Finally, reorder the columns:

In [37]:
users = users[['user', 'tweets', 'followers_max', 'friends_max']]

The index will function as a unique user identifier:

In [38]:
users

                                    user  tweets  followers_max  friends_max
0       7513717dba8b208fe06799dcc54e59e2     464       21985195         1116
1       2435a45b85628172c5a47122144a7c67     357       48295579         1109
2       4ff35e52034daec0251f7b3370969a1a     353        4149063            0
3       090264f1888056a96f32ccb7d91ba4e7     321        3788655          266
4       bf4571b94429c5b18e0a219c197a56a4     278        6145493           28
...                                  ...     ...            ...          ...
353369  ff0b29d605ef1707c95bc7e8c8fb6694       1              0            0
353370  ff6a57fc7c7cd18cc2a293b79493756a       1              0            0
353371  ffc5ea3bff62a184be9cdcd399ec27dd       1              0            0
353372  ffeb62654f94d36a4075ca408ecf0089       1              0            0
353373  fff237115d3d097c0c0d8064cc15048b       1              0            0

[353374 rows x 4 columns]

Note that 'user' names are encrypted for privacy reasons in the original dataset. There are 350 thousand distinct users (1.1 million in the full dataset), and the most active one has created 1,989 tweets (in the full dataset). Indeed, it is not an error that some users have tens of millions of followers [and more](https://en.wikipedia.org/wiki/List_of_most-followed_Twitter_accounts). An interesting observation is that the most active users also have many followers.

The index values of this table are unique identifiers for the users in the dataset (the primary keys). The effect of sorting is that the most active users have small index values, which aids computational purposes, as you will see. To not waste memory, it is good practice to delete dataframes we do not need anymore:

In [39]:
del users_ff

#### Creating the `tweets` table

We will proceed by refining the existing `tweets` table. Sorting tweets by date and time is straightforward. For handling such data, Pandas provides the 'datetime' data type. It is perfectly suited for handling time series data as it allows many ways to manipulate dates and times. For now, we will simply transform the 'timestamp' values from 'string' [`to_datetime()`](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html). Set the `format` of the original string to spare Pandas figuring it out itself (and save time):

In [40]:
tweets['timestamp'] = pd.to_datetime(tweets['timestamp'], format='%a %b %d %X %z %Y')

Knowing that the timezone is Coordinated Universal Time (UTC), remove it:

In [41]:
print(tweets['timestamp'].dt.tz)
tweets['timestamp'] = tweets['timestamp'].dt.tz_localize(tz=None)

UTC

Then remove tweets from April 2020 (since they are not complete) and sort the dataframe:

In [42]:
tweets = tweets[tweets['timestamp'] >= '2020-05-01']
tweets = tweets.sort_values(by=['timestamp']).reset_index(drop=True)
tweets.head()

,tweet_id,user,timestamp,followers,friends,retweets,favorites,named_entities,sentiments,mentions,hashtags,urls
0,1256010446827433984,4abcedcab022df9a8ecaecc7399fb4f2,2020-05-01 00:00:00,7449,636,3,2,null;,2 -1,null;,domesticviolence,null;
1,1256010446559039488,9897f9df6e48f764570e5e4535833703,2020-05-01 00:00:00,85194,1496,0,0,null;,2 -1,null;,null;,https://www.themarysue.com/yes-i-would-use-thi...
2,1256010445908881410,d67ad51dab16d347d48c819bdd284ea2,2020-05-01 00:00:00,88212,635,13,43,sesame street:Sesame_Street:-1.0571497380025907;,2 -1,null;,null;,https://thehardtimes.net/culture/sesame-street...
3,1256010447377104898,8c3f9d949ad79d3e2023b7486997ff41,2020-05-01 00:00:00,359853,811,1,0,coronavirus disease 2019:Coronavirus_disease_2...,1 -3,RitaRubin,coronavirus convalescentplasma COVID19,https://jamanetwork.com/journals/jama/fullarti...
4,1256010459125178369,2c0f39371993cc0b77ead929b4f94cff,2020-05-01 00:00:03,55619,151,0,0,jeff bezos:Jeff_Bezos:-0.814832966325326;amazo...,3 -1,null;,null;,http://i.securitythinkingcap.com/RVnWKF:-:

After sorting, the index is stable and acts as a unique tweet identifier.

The first change the table needs is to replace the 'user' name with the 'user_idx' index from the `users` table. Since we will repeat this operation for other tables, we define an `add_index()` function. Following best Python practice, what it does is described in the function itself:

In [43]:
def add_index(source, target, entity):
    '''
    Inserts the index of a source dataframe into a target dataframe as a column.
    
    Parameters:
        source : Pandas DataFrame
            Dataframe whose index is to be inserted.
        target : Pandas DataFrame
            Dataframe into which the index is inserted.
        entity : String
            Name of the entity that is identified by the index. Will be given an '_idx' suffix and then inserted into the target dataframe.
    
    Returns:
        The target dataframe with the inserted column.
    '''
    _ = source.copy()
    _[entity + '_idx'] = _.index
    df = pd.merge(left=target, right=_[[entity + '_idx', entity]], on=entity)
    del df[entity]
    return df

In [44]:
tweets = add_index(source=users, target=tweets, entity='user')

After reordering the columns, the 'user_idx' column is at the right position:

In [45]:
tweets = tweets[['tweet_id', 'user_idx', 'timestamp', 'followers', 'friends', 'retweets', 'favorites', 'named_entities', 'sentiments', 'mentions', 'hashtags', 'urls']]
tweets.head()

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,named_entities,sentiments,mentions,hashtags,urls
0,1256010446827433984,80519,2020-05-01 00:00:00,7449,636,3,2,null;,2 -1,null;,domesticviolence,null;
1,1256010446559039488,51478,2020-05-01 00:00:00,85194,1496,0,0,null;,2 -1,null;,null;,https://www.themarysue.com/yes-i-would-use-thi...
2,1256010445908881410,4418,2020-05-01 00:00:00,88212,635,13,43,sesame street:Sesame_Street:-1.0571497380025907;,2 -1,null;,null;,https://thehardtimes.net/culture/sesame-street...
3,1257097608738140161,4418,2020-05-04 00:00:00,88395,635,2,8,cdc:Centers_for_Disease_Control_and_Prevention...,1 -1,null;,null;,https://thehardtimes.net/culture/bald-guy-push...
4,1259256865126600705,4418,2020-05-09 23:00:07,88644,634,65,201,doomsday preppers:Doomsday_Preppers:-1.5662125...,1 -2,null;,null;,https://thehardtimes.net/music/doomsday-preppe...

#### Creating the `named_entities` and `tweets_named_entities` tables

Next, we process the facts. In general, we proceed by, first, extracting relationship tables from the `tweets` table and, second, deriving the entity tables from the relationship tables. We start with the most complicated case of **named entities**. The 'named_entities' column of the `tweets` table contains ';'-separated 3-tuples, each of which contains ':'-separated values for 'text', 'named_entity', and 'confidence'. In the process of normalization, the first step is to transform cell content into lists of 3-tuples. Again, we define a custom `to_list()` function...

In [46]:
def to_list(cell, pat):
    '''
    Function to be applied to individual cells of a dataframe column. Transforms concatenated cell content into a list.
    
    Parameters:
        pat : String
            Pattern that separates the cell values.
    
    Returns:
        The cell will automatically be overwritten by a potentially empty list.
    '''
    if cell == 'null;' or type(cell) == float:
        cell = ['']
    else:
        cell = cell.split(pat)
    return cell

that we can now `apply` cell by cell to the 'named_entities' column:

In [47]:
tweets['named_entities'] = tweets['named_entities'].apply(to_list, pat=';')

An example cell with a list of multiple 3-tuples now looks like this:

In [48]:
tweets['named_entities'][2]

['sesame street:Sesame_Street:-1.0571497380025907', '']

Next, we create the `tweets_named_entities` relationship table. The reason for having created a list of 3-tuples is that a wide table – the subtable with just the 'named_entities' column – can be easily and quickly transformed into a long table using the [`explode()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.explode.html) method:

In [49]:
tweets_named_entities = tweets[['named_entities']].explode(column='named_entities')
del tweets['named_entities']
tweets_named_entities.head()

                                      named_entities
0
1
2    sesame street:Sesame_Street:-1.0571497380025907
2
3  cdc:Centers_for_Disease_Control_and_Prevention...

Remove rows without 3-tuples (concatenation artifacts) and split the 3-tuples into three columns by splitting the string at ':':

In [50]:
tweets_named_entities = tweets_named_entities[tweets_named_entities['named_entities'] != '']
tweets_named_entities = tweets_named_entities['named_entities'].str.split(pat=':', expand=True)
tweets_named_entities.head()

,0,1,2
2,sesame street,Sesame_Street,-1.0571497380025907
3,cdc,Centers_for_Disease_Control_and_Prevention,-2.5639323763517483
4,doomsday preppers,Doomsday_Preppers,-1.5662125698192169
4,ska,Ska,-1.7401045224490466
7,hydroxychloroquine,Hydroxychloroquine,-1.083599029221355

At this point, the index consists of the unique tweet identifiers because we used `explode()` on a `tweets` subtable.

<div class='alert alert-block alert-info'>
<b>Insight: Data quality</b>

Part of what we call "getting a feeling for your data" is actually to look at it. For example, here is the right stage in the data processing pipeline to check how well the named-entity-recognition algorithm worked because the `tweets_named_entities` table still contains the 'text' from which a named entity was recognized as well as the name of the 'named_entity'. Pandas is actually not the best tool to read tables as it only displays up to 50 rows at a time. You can cycle through your columns using `loc[]`, but it is more convenient to use a spreadsheet editor for the task. Therefore, we export the distinct rows of the `tweets_named_entities` table to an Excel file. The first column is the tweet index, and you can look up the 'tweet_id' via `tweets.loc[<tweet index without angle brackets>, :]`. You can read the actual tweet of any user (*e.g.*, with the 'tweet id' $1262933787131904001$) by visiting https://twitter.com/anyuser/status/1262933787131904001.

Going through the rows, you will notice that the text snippet <span style='font-family:Courier'>democrat</span> is matched to the [Democratic_Party_(United_States)](https://en.wikipedia.org/wiki/Democratic_Party_(United_States)) named entity with a confidence of -1.81. Even though the matching is mostly right in our particular context, the algorithm will also mismatch a lot of discourse about democracy itself. The problem also exists the other way around. The text <span style='font-family:Courier'>dems</span>, which is frequently used to name the Democratic Party of the US, is matched to [Defensively_equipped_merchant_ship](https://en.wikipedia.org/wiki/Defensively_equipped_merchant_ship) with a slightly weaker confidence of -2.03. The idea is to use this score to filter out bad matchings. However, setting the filter to -2.00 would result in missing the correct matching of <span style='font-family:Courier'>us democratic party</span>, which has a score of -2.06. As you go through the spreadsheet, you will notice more mistakes. All these point to the general problem of fully automated data processing.
</div>

Before the Excel file is saved, the target directory is created if it does not exist:

In [51]:
import os

directory = 'results'
if not os.path.exists(directory):
    os.makedirs(directory)

In [52]:
# If you are running this session in Google Colab, install this package
#!pip install xlsxwriter==3.0.3

In [53]:
tweets_named_entities.drop_duplicates().to_excel(
    excel_writer = 'results/tweets_named_entities_dropped_duplicates.xlsx', 
    engine = 'xlsxwriter'
)

Continuing with creating `tweets_named_entities`, if we now reset the index without dropping the old one, the tweet index values will be added as the first column:

In [54]:
tweets_named_entities = tweets_named_entities.reset_index(drop=False)
tweets_named_entities.columns = ['tweet_idx', 'text', 'named_entity', 'confidence']
tweets_named_entities.head()

,tweet_idx,text,named_entity,confidence
0,2,sesame street,Sesame_Street,-1.0571497380025907
1,3,cdc,Centers_for_Disease_Control_and_Prevention,-2.5639323763517483
2,4,doomsday preppers,Doomsday_Preppers,-1.5662125698192169
3,4,ska,Ska,-1.7401045224490466
4,7,hydroxychloroquine,Hydroxychloroquine,-1.083599029221355

Drop duplicate relationships because we are not interested in multiple occurrences of a named entity in one tweet:

In [55]:
tweets_named_entities = tweets_named_entities.drop_duplicates().reset_index(drop=True)

The `named_entities` entity table with the desired 'tweets' column is created from the `tweets_named_entities` relationship table, again using a dedicated function:

In [56]:
def create_entity_table(relationship_table, entity):
    '''
    Creates an entity table from a relationship table via aggregation.
    
    Parameters:
        relationship_table : Pandas DataFrame
            Dataframe that contains tweet entity relationships.
        entity : String
            Name of the entity column in the relationship table that contains the entities.
    
    Returns:
        An entity table sorted descendingly by an additional 'tweets' column giving the number of tweets that selected an entity.
    '''
    df = relationship_table.groupby(entity).size().reset_index(name='tweets')
    df = df.sort_values(by=['tweets', entity], ascending=[False, True]).reset_index(drop=True)
    return df

In [57]:
named_entities = create_entity_table(relationship_table=tweets_named_entities, entity='named_entity')
named_entities.head()

               named_entity  tweets
0  Coronavirus_disease_2019   34212
1                Quarantine   17190
2                     China   12892
3         Social_distancing    9636
4                   Twitter    8905

Given this entity table, add its index to the corresponding `tweets_named_entities` relationship table, reorder the columns to obtain the desired design, and change the data type of the 'confidence' scores from string to a rounded float:

In [58]:
tweets_named_entities = add_index(source=named_entities, target=tweets_named_entities, entity='named_entity')
tweets_named_entities = tweets_named_entities[['tweet_idx', 'named_entity_idx', 'text', 'confidence']]
tweets_named_entities['confidence'] = tweets_named_entities['confidence'].astype(float).round(4)
tweets_named_entities.head()

   tweet_idx  named_entity_idx           text  confidence
0          2              6611  sesame street     -1.0571
1       3890              6611  sesame street     -1.0571
2      77675              6611  sesame street     -1.0571
3     207706              6611  sesame street     -1.0571
4     216831              6611  sesame street     -1.0571

#### Creating the other relationship and entity tables

The data of the remaining facts (mentions, hashtags, URLs, and TLDs) is easier to normalize because the relationship tables only contain foreign keys. Without having to process metadata from named entity recognition, we can create the relationship tables via a general function:

In [59]:
def create_relationship_table(entity, to_lower_case, drop_duplicates=True, source=tweets):
    '''
    Creates a relationship table for a given entity from the `tweets` table.
    
    Parameters:
        source : Pandas DataFrame, default `tweets`
            Table that contains the entity column.
        entity : String
            Name of the entity column in the source table that contains the entities. The column must contain an object data type list of entity names.
        to_lower_case : Boolean
            Whether entity names should be reduced to lower case.
        drop_duplicates : Boolean, default True
            Whether duplicate relationships should be removed.
    
    Returns:
        A relationship table linking tweet indices to entity names.
    '''
    df = source[[entity + 's']].explode(column=entity + 's')
    df = df[df[entity + 's'] != '']
    df = df.reset_index()
    df.columns = ['tweet_idx', entity]
    if to_lower_case == True:
        df[entity] = df[entity].str.lower()
    if drop_duplicates == True:
        df = df.drop_duplicates().reset_index(drop=True)
    return df

The processing pipeline is the same for all four facts:

1. Transform the entity column in the `tweets` table to a list
2. Create the relationship table from the entity column in the `tweets` table, dropping duplicate rows by default
3. Delete the entity column in the `tweets` table
4. Create the entity table from the relationship table
5. Add the entity index to the relationship table

In the case of **mentions**, in step 2, we must transform all capital (upper case) characters to lower case. This is because user names on Twitter are not case-sensitive. In other words, when a user named "realDonaldTrump" already exists, no new user will be allowed with the name "realdonaldtrump". Since user mentions are extracted as words starting with <span style='font-family:Courier'>@</span>, but tweet creators often use upper and lower cases as they wish, not transforming upper to lower case would result in the same mentioned user getting more than a single unique identifier.

In [60]:
tweets['mentions'] = tweets['mentions'].apply(to_list, pat=' ') # Step 1
tweets_mentions = create_relationship_table(entity='mention', to_lower_case=True) # Step 2
del tweets['mentions'] # Step 3
mentions = create_entity_table(relationship_table=tweets_mentions, entity='mention') # Step 4
tweets_mentions = add_index(source=mentions, target=tweets_mentions, entity='mention') # Step 5

In [61]:
mentions.head()

           mention  tweets
0  realdonaldtrump    9396
1         pmoindia    1650
2     narendramodi    1571
3       jaketapper    1493
4          youtube    1383

Donald Trump is the most mentioned user by far, followed by the prime minister of India. Narendra Modi. both with his official and private accounts.

In the case of **hashtags**, do the same transformation from upper to lower case to prevent synonymous hashtags getting from different indices:

In [62]:
tweets['hashtags'] = tweets['hashtags'].apply(to_list, pat=' ') # Step 1
tweets_hashtags = create_relationship_table(entity='hashtag', to_lower_case=True) # Step 2
del tweets['hashtags'] # Step 3
hashtags = create_entity_table(relationship_table=tweets_hashtags, entity='hashtag') # Step 4
tweets_hashtags = add_index(source=hashtags, target=tweets_hashtags, entity='hashtag') # Step 5

In [63]:
hashtags.head()

       hashtag  tweets
0      covid19   21447
1  coronavirus    9986
2     covid_19    3157
3     lockdown    2951
4     stayhome    2793

**URLs** are case-sensitive. Hence, set `to_lower_case=False` in step 2. To create the tables related to **TLDs**, postpone the step 5:

In [64]:
tweets['urls'] = tweets['urls'].apply(to_list, pat=':-:') # Step 1
tweets_urls = create_relationship_table(entity='url', to_lower_case=False) # Step 2
del tweets['urls'] # Step 3
urls = create_entity_table(relationship_table=tweets_urls, entity='url') # Step 4

At this point, `tweets_urls` has all the information to create the TLD-related tables. Create the ``tweets_tlds`` as a copy of `tweets_urls` and extract the TLDs (pseudo step 2):

In [65]:
tweets_tlds = tweets_urls.copy()
tweets_tlds['tld'] = tweets_tlds['url'].str[8:].str.split(pat='/').str[0]

Now, finish step 5 for URLs...

In [66]:
tweets_urls = add_index(source=urls, target=tweets_urls, entity='url') # Step 5

and steps 4 and 5 for TLDs (step 3 is not necessary since no such column ever existed):

In [67]:
tlds = create_entity_table(relationship_table=tweets_tlds, entity='tld') # Step 4
tweets_tlds = add_index(source=tlds, target=tweets_tlds, entity='tld') # Step 5

In [68]:
urls.head()

                                                 url  tweets
0                https://www.twittascope.com/?sign=5     136
1  https://api.whatsapp.com/send?phone=9190393567...      82
2  https://redcross.give.asia/campaign/essentials...      76
3                https://www.twittascope.com/?sign=7      69
4                        http://rebrand.ly/work-2020      62

In [69]:
tlds.head()

                   tld  tweets
0          twitter.com    8930
1      www.youtube.com    6529
2    www.instagram.com    3020
3  www.theguardian.com    2206
4      www.nytimes.com    1767

As expected, the detail of URLs hides which TLDs are most popular.

#### Sentiment data

Positive and negative sentiment scores are stored as a string in `tweets['sentiments']`. To construct the desired three columns from it, we only have to split and expand the string (line 1), and transform the scores into integers (lines 2–3), create the average score (line 4), ...

In [70]:
tweets_sentiments = tweets['sentiments'].str.split(pat=' ', expand=True)
tweets_sentiments[0] = tweets_sentiments[0].astype('int')
tweets_sentiments[1] = tweets_sentiments[1].astype('int')
tweets_sentiments[2] = tweets_sentiments[[0, 1]].mean(axis=1)
tweets_sentiments.head()

   0  1    2
0  2 -1  0.5
1  2 -1  0.5
2  2 -1  0.5
3  1 -1  0.0
4  1 -2 -0.5

and append these columns to the `tweets` table:

In [71]:
tweets[['sentiment_pos', 'sentiment_neg', 'sentiment_avg']] = tweets_sentiments
del tweets['sentiments']
tweets.head()

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
0,1256010446827433984,80519,2020-05-01 00:00:00,7449,636,3,2,2,-1,0.5
1,1256010446559039488,51478,2020-05-01 00:00:00,85194,1496,0,0,2,-1,0.5
2,1256010445908881410,4418,2020-05-01 00:00:00,88212,635,13,43,2,-1,0.5
3,1257097608738140161,4418,2020-05-04 00:00:00,88395,635,2,8,1,-1,0.0
4,1259256865126600705,4418,2020-05-09 23:00:07,88644,634,65,201,1,-2,-0.5

As the data is structured now, it is not fully normalized because the `tweets` table is still wide regarding sentiment scores. In a way, it is like the `bad_table` in the toy example above, which did not allow us to compute an average easily. It is worth discussing whether or not it is necessary to fully normalize the data and store the three sentiment scores in a relationship table and the sentiment category in yet another table.For most tasks, working with the three columns in the `tweets` table will certainly be easier. However, as we will see in the following subsection, it is beneficial to normalize our data all the way through. With `tweets_sentiments`, we already have the first step for the relationship table. Use the [`melt()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.melt.html) function, which makes this wide subtable long ([`ignore_index=False`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.melt.html) keeps the tweet index as a column). With the few steps in the following cell, we have already completed steps 2, 3, and 5 from the pipeline:

In [72]:
tweets_sentiments = pd.melt(tweets_sentiments, ignore_index=False).reset_index()
tweets_sentiments.columns = ['tweet_idx', 'sentiment_idx', 'score']
tweets_sentiments.head()

   tweet_idx  sentiment_idx  score
0          0              0    2.0
1          1              0    2.0
2          2              0    2.0
3          3              0    1.0
4          4              0    1.0

The only thing left to do is to create the `sentiments` table, which contains the labels for the 'sentiment_idx' in `tweets_sentiments`. We have to make this manually as we have not introduced these labels yet:

In [73]:
sentiments = pd.DataFrame(data=['positive', 'negative', 'average'], columns=['sentiment'])
sentiments

  sentiment
0  positive
1  negative
2   average

## A2.3. Saving the tables to file(s)

#### Multiple TSV files

Now that we have a set of linked tables, how do we store them? A simple way is to save each table to a file with tab-separated values (TSV) using [`to_csv(sep='\t')`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html). To save space, we create compressed files (`compression='gzip'`):

In [74]:
directory = 'results/TweetsCOV19_tables'
if not os.path.exists(directory):
    os.makedirs(directory)

In [75]:
tweets.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
users.to_csv(path_or_buf='results/TweetsCOV19_tables/users.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_named_entities.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_named_entities.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_mentions.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_mentions.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_hashtags.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_hashtags.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_urls.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_urls.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_tlds.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_tlds.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tweets_sentiments.to_csv(path_or_buf='results/TweetsCOV19_tables/tweets_sentiments.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
named_entities.to_csv(path_or_buf='results/TweetsCOV19_tables/named_entities.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
mentions.to_csv(path_or_buf='results/TweetsCOV19_tables/mentions.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
hashtags.to_csv(path_or_buf='results/TweetsCOV19_tables/hashtags.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
urls.to_csv(path_or_buf='results/TweetsCOV19_tables/urls.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
tlds.to_csv(path_or_buf='results/TweetsCOV19_tables/tlds.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')
sentiments.to_csv(path_or_buf='results/TweetsCOV19_tables/sentiments.tsv.gz', sep='\t', index=False, encoding='utf-8', compression='gzip')

Note that, in the above cell, we set `index=False`. That means the index is not written to file.
This is not a problem because it is a row counter starting with 0 in any table. Such an index is automatically created if `index_col=None` when reading these files:

In [76]:
pd.read_csv(
    filepath_or_buffer = 'results/TweetsCOV19_tables/tweets.tsv.gz', 
    sep = '\t', 
    index_col = None, 
    encoding = 'utf-8'
)

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
0,1256010446827433984,80519,2020-05-01 00:00:00,7449,636,3,2,2,-1,0.5
1,1256010446559039488,51478,2020-05-01 00:00:00,85194,1496,0,0,2,-1,0.5
2,1256010445908881410,4418,2020-05-01 00:00:00,88212,635,13,43,2,-1,0.5
3,1257097608738140161,4418,2020-05-04 00:00:00,88395,635,2,8,1,-1,0.0
4,1259256865126600705,4418,2020-05-09 23:00:07,88644,634,65,201,1,-2,-0.5
...,...,...,...,...,...,...,...,...,...,...
479220,1267214187530518530,260207,2020-05-31 21:59:40,135,159,0,0,2,-1,0.5
479221,1267214200100859904,106346,2020-05-31 21:59:43,3134,2020,0,0,1,-1,0.0
479222,1267214225270685696,265518,2020-05-31 21:59:49,118,419,0,0,1,-4,-1.5
479223,1267214225283231744,255871,2020-05-31 21:59:49,149,341,0,0,2,-3,-0.5
479224,1267214242060500992,164068,2020-05-31 21:59:53,892,1080,0,0,2,-1,0.5

#### SQL

One benefit of a relational database is that it can be stored in one file. Hence, another possibility is to take the next step on the relational database path and store all tables in an SQL database. [SQLAlchemy](https://www.sqlalchemy.org/) has emerged as the standard Python package for working with databases in SQL-like ways. To store the twelve tables from *figure 3*, all you need to do before exporting the tables is to create a so-called "engine" that manages connections through which you create, modify, and query the database. In this case, we create an SQLite database (other SQL dialects are possible):

In [77]:
import sqlalchemy
sqlalchemy.__version__

'1.4.39'

In [78]:
engine = sqlalchemy.create_engine(url='sqlite:///results/TweetsCOV19.sql')

Use the [`to_sql()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html) method, configured to use the engine just created, to add the tables to the database (the following lines just add the first five rows of each table; to add all rows remove `.head()`; a table is replaced if it already exists):

In [79]:
tweets.head().to_sql(name='tweets', con=engine, if_exists='replace', index=False)
users.head().to_sql(name='users', con=engine, if_exists='replace', index=False)
tweets_named_entities.head().to_sql(name='tweets_named_entities', con=engine, if_exists='replace', index=False)
tweets_mentions.head().to_sql(name='tweets_mentions', con=engine, if_exists='replace', index=False)
tweets_hashtags.head().to_sql(name='tweets_hashtags', con=engine, if_exists='replace', index=False)
tweets_urls.head().to_sql(name='tweets_urls', con=engine, if_exists='replace', index=False)
tweets_tlds.head().to_sql(name='tweets_tlds', con=engine, if_exists='replace', index=False)
tweets_sentiments.head().to_sql(name='tweets_sentiments', con=engine, if_exists='replace', index=False)
named_entities.head().to_sql(name='named_entities', con=engine, if_exists='replace', index=False)
mentions.head().to_sql(name='mentions', con=engine, if_exists='replace', index=False)
hashtags.head().to_sql(name='hashtags', con=engine, if_exists='replace', index=False)
urls.head().to_sql(name='urls', con=engine, if_exists='replace', index=False)
tlds.head().to_sql(name='tlds', con=engine, if_exists='replace', index=False)
sentiments.head().to_sql(name='sentiments', con=engine, if_exists='replace', index=False)

3

To read a dataframe from the database, also use the engine, but now in the [`read_sql()`](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html) method:

In [80]:
pd.read_sql(sql='tweets', con=engine).head()

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
0,1256010446827433984,80519,2020-05-01 00:00:00,7449,636,3,2,2,-1,0.5
1,1256010446559039488,51478,2020-05-01 00:00:00,85194,1496,0,0,2,-1,0.5
2,1256010445908881410,4418,2020-05-01 00:00:00,88212,635,13,43,2,-1,0.5
3,1257097608738140161,4418,2020-05-04 00:00:00,88395,635,2,8,1,-1,0.0
4,1259256865126600705,4418,2020-05-09 23:00:07,88644,634,65,201,1,-2,-0.5

#### Excel

It is also possible to store all tables as sheets in an Excel file. However, the limit is one million rows and columns per sheet, so Excel is not an option for the full dataset. But this is how the tables can be exported in principle:

In [81]:
with pd.ExcelWriter(path='results/TweetsCOV19.xlsx', engine='xlsxwriter') as writer:
    tweets.head().to_excel(writer, sheet_name='tweets')
    users.head().to_excel(writer, sheet_name='users')
    tweets_named_entities.head().to_excel(writer, sheet_name='tweets_named_entities')
    tweets_mentions.head().to_excel(writer, sheet_name='tweets_mentions')
    tweets_hashtags.head().to_excel(writer, sheet_name='tweets_hashtags')
    tweets_urls.head().to_excel(writer, sheet_name='tweets_urls')
    tweets_tlds.head().to_excel(writer, sheet_name='tweets_tlds')
    named_entities.head().to_excel(writer, sheet_name='named_entities')
    mentions.head().to_excel(writer, sheet_name='mentions')
    hashtags.head().to_excel(writer, sheet_name='hashtags')
    urls.head().to_excel(writer, sheet_name='urls')
    tlds.head().to_excel(writer, sheet_name='tlds')

To read a sheet from that file:

In [82]:
pd.read_excel(io='results/TweetsCOV19.xlsx', sheet_name='tweets', index_col=0)

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
0,1256010446827433984,80519,2020-05-01 00:00:00,7449,636,3,2,2,-1,0.5
1,1256010446559038976,51478,2020-05-01 00:00:00,85194,1496,0,0,2,-1,0.5
2,1256010445908880896,4418,2020-05-01 00:00:00,88212,635,13,43,2,-1,0.5
3,1257097608738139904,4418,2020-05-04 00:00:00,88395,635,2,8,1,-1,0.0
4,1259256865126600960,4418,2020-05-09 23:00:07,88644,634,65,201,1,-2,-0.5

## A2.4. Querying the database just created

Querying is a term from the relational database world and it means to extract information from the database. **Filtering tables** is a simple query.

#### Which tweet named-entity relationships can we be confident about?

Recall from the discussion above that matches below a threshold (*e.g.*, -2) may be too biased.

In [83]:
tweets_named_entities[tweets_named_entities['confidence'] >= -2.].head()

   tweet_idx  named_entity_idx           text  confidence
0          2              6611  sesame street     -1.0571
1       3890              6611  sesame street     -1.0571
2      77675              6611  sesame street     -1.0571
3     207706              6611  sesame street     -1.0571
4     216831              6611  sesame street     -1.0571

#### Which are the most popular tweets by unpopular users?

This question is open to interpretation. If we think of popular tweets as those with many retweets and unpopular users as those with few followers, then a possible answer can be:

In [84]:
tweets[(tweets['retweets'] >= 1000) & (tweets['followers'] <= 10)]

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
448246,1266127346945359884,334672,2020-05-28 22:00:57,6,1,1448,7903,1,-5,-2.0

Such queries are useful to identify tweets for reading. For unsampled tweets, the first two are:

- https://twitter.com/anyuser/status/1262661210647887872
- https://twitter.com/anyuser/status/1265468721440514048

The third was probably deleted by the user.

Since we have eliminated redundancy (*i.e.*, split up data in multiple tables), we also need to link tables to answer certain questions. Linking tables goes by the name of **joining tables**. We will introduce the use of Pandas' [`join()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html) method step by step using this question:

#### Which are the most popular tweets by unproductive users?

The logic of joining is to link two tables on their indices or a column that exists in both tables. If no column name is specified, Pandas joins on the index by default. You can build a query step by step. Choose a dataframe from which you want to start. In our case, this is the table of popular `tweets`:

In [85]:
popular_tweets = tweets[tweets['retweets'] >= 1000]
popular_tweets.head()

,tweet_id,user_idx,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
24,1256734073231474690,113,2020-05-02 23:55:26,673422,2783,5853,9574,1,-1,0.0
33,1257852630677643267,113,2020-05-06 02:00:11,673542,2786,1123,3395,1,-1,0.0
45,1259825193830268928,113,2020-05-11 12:38:27,675136,2785,1646,3033,2,-1,0.5
47,1260036554044702721,113,2020-05-12 02:38:19,675112,2785,1065,2856,1,-3,-1.0
51,1261282495514935300,113,2020-05-15 13:09:15,676182,2784,7788,21508,1,-3,-1.0

The other dataframe that contains information to answer the question is the table of unproductive (*i.e.*, one tweet only) users:

In [86]:
unproductive_users = users[users['tweets'] == 1]

To be able to join these tables on an index, we have stored the 'user_idx' in the `tweets` – and, hence, `popular_tweets` – table. Set this column as the index of the `popular_tweets` table, join the `unproductive_users` table, and sort the result by the number of `retweets`. Adding `[[]]` in line 2 has the effect that no columns of the `unproductive_users` table are actually added to the result, and `how='inner'` in line 3 has the effect that not all popular tweets are shown but only those whose creators are unproductive:

In [87]:
popular_tweets.set_index(keys='user_idx').join(
    other = unproductive_users[[]], 
    how = 'inner'
).sort_values(by='retweets', ascending=False).head()

,tweet_id,timestamp,followers,friends,retweets,favorites,sentiment_pos,sentiment_neg,sentiment_avg
136161,1266546753182056453,2020-05-30 01:47:31,1545,874,66604,193599,3,-1,1.0
147295,1266494398080172032,2020-05-29 22:19:29,1236,338,56716,237580,1,-4,-1.5
85442,1265095165397491712,2020-05-26 01:39:26,6066,426,54193,535341,1,-1,0.0
224199,1266876587544162304,2020-05-30 23:38:10,291,96,49463,237504,1,-1,0.0
120093,1266554184607956992,2020-05-30 02:17:03,2215,667,44977,166352,1,-2,-0.5

The above query only uses one join. Other queries can also require multiple joins:

#### How often is a given hashtag used over time?

In this example, the result must be constructed from two tables linked by a relationship table, so we need two joins. There are several ways to build the query. You can start with either table. Here, we start with the relationship table. First, join the `tweets` table with just the 'timestamp' column to the `tweets_hashtags` table  via the tweet index (lines 1–2). Second, join the `hashtags` table, filtered to only contain hashtags from `hashtag_list`, to the resulting table via the hashtag index (lines 3–6). Line 7 shows how the date can be extracted from the timestamp (in other words, how hours, minutes, and seconds can be removed). Line 9 aggregates the data and counts the number of tweets that use a given hashtag on a given day:

In [88]:
hashtag_list = ['coronavirus', 'covid19', 'hydroxychloroquine', 'vaccine']

In [89]:
days_hashtags_long = tweets_hashtags.set_index(keys='tweet_idx').join(
    other = tweets[['timestamp']]
).set_index(keys='hashtag_idx').join(
    other = hashtags[hashtags['hashtag'].isin(hashtag_list)][['hashtag']], 
    how = 'inner'
)
days_hashtags_long['day'] = days_hashtags_long['timestamp'].dt.date
del days_hashtags_long['timestamp']
days_hashtags_long = days_hashtags_long.groupby(by=['day', 'hashtag']).size().reset_index(name='tweets')
days_hashtags_long.head()

          day             hashtag  tweets
0  2020-05-01         coronavirus     440
1  2020-05-01             covid19     918
2  2020-05-01  hydroxychloroquine       2
3  2020-05-01             vaccine       4
4  2020-05-02         coronavirus     365

In [90]:
days_hashtags_long.to_csv(path_or_buf='results/days_hashtags_long.tsv', sep='\t', index=False, encoding='utf-8')

<div class='alert alert-block alert-warning'>
<b>Additional resources</b>

We have set up the TweetsCOV19 dataset in a relational database way and even stored it as an SQL database. It is also possible to use SQL commands to retrieve information from this dataset. Consult the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html) of Pandas' `read_sql()` method and the SQLAlchemy [tutorials](https://docs.sqlalchemy.org/en/14/tutorial/index.html) as entry points. See the following code cell for instant success (it requires the engine from above).
</div>

In [91]:
pd.read_sql(sql='SELECT hashtag, tweets FROM hashtags', con=engine).head()

       hashtag  tweets
0      covid19   21447
1  coronavirus    9986
2     covid_19    3157
3     lockdown    2951
4     stayhome    2793

This concludes Session A2: Data management with Pandas. Some of the tables created here will be used in later sessions. Please continue with [Session A3](3_scientific_computing_and_data_visualization.ipynb) which is about scientific computing and data visualization with NumPy, SciPy, and Seaborn.

## References

### Recommended readings

<a id='mclevey_doing_2022'></a>
McLevey, J. (2022). *Doing Computational Social Science: A Practical Introduction*. SAGE. https://us.sagepub.com/en-us/nam/doing-computational-social-science/book266031. *A rather complete introduction to the field with well-structured and insightful chapters also on using Pandas. The [website](https://github.com/UWNETLAB/dcss_supplementary) offers the code used in the book. For this session, read **ch. 6** on processing structured data.*

<a id='weidmann_data_2023'></a>
Weidmann, N. B. (2023). *Data Management for Social Scientists: From Files to Databases*. Cambridge University Press. *A fresh account of data management and processing. The book uses R, but general insights also apply to Python. For this session, read **chs. 1 and 3** on data processing and structures.*

### Complementary readings

<a id='dimitrov_tweetscov19_2020'></a>
Dimitrov, D., Baran, E., Fafalios, P., Yu, R., Zhu, X., Zloch, M., & Dietze, S. (2020). TweetsCOV19 - A Knowledge Base of Semantically Annotated Tweets about the COVID-19 Pandemic. In: *CIKM '20: Proceedings of the 29th ACM International Conference on Information & Knowledge Management* (p. 2991–2998). https://doi.org/10.1145/3340531.3412765. *Technical account how the TweetsCOV19 dataset has been created.*

<a id='fafalios_tweetskb_2018'></a>
Fafalios, P., Iosifidis, V., Ntoutsi, E., & Dietze, S. (2018). TweetsKB: A Public and Large-Scale RDF Corpus of Annotated Tweets. In: *The Semantic Web. ESWC 2018. Lecture Notes in Computer Science*, vol 10843. Springer, Cham. https://doi.org/10.1007/978-3-319-93417-4_12. *Technical account how the TweetsKB dataset has been created.*

<a id='wikipedia_twitter_2022'></a>
Wikipedia (2022). Twitter. https://en.wikipedia.org/wiki/Twitter. Retrieved 01.12.2022.

<div class='alert alert-block alert-success'>
<b>Document information</b>

Contact and main author: Haiko Lietz

Contributors: Pouria Mirelmi & N. Gizem Bacaksizlar Turbic

Acknowledgements: Olga Zagovora

Version date: 8 August 2023

License: Creative Commons Attribution 4.0 International (CC BY 4.0)
</div>